zkntech/corelib/STM32Cube_FW_F1_V1.0.0RC1/CMSIS/Device/ST/STM32F1xx/Include/stm32f1xxxxx.h
#define  FSMC_BWTRx_DATLAT                   ((uint32_t)0x0F000000)        /*!< DATLA[3:0] bits (Data latency) */
#define  FSMC_BWTRx_DATLAT_0                 ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  FSMC_BWTRx_DATLAT_1                 ((uint32_t)0x02000000)        /*!< Bit 1 */
#define  FSMC_BWTRx_DATLAT_2                 ((uint32_t)0x04000000)        /*!< Bit 2 */
#define  FSMC_BWTRx_DATLAT_3                 ((uint32_t)0x08000000)        /*!< Bit 3 */

#endif
#define  FSMC_BWTRx_ACCMOD                   ((uint32_t)0x30000000)        /*!< ACCMOD[1:0] bits (Access mode) */
#define  FSMC_BWTRx_ACCMOD_0                 ((uint32_t)0x10000000)        /*!< Bit 0 */
#define  FSMC_BWTRx_ACCMOD_1                 ((uint32_t)0x20000000)        /*!< Bit 1 */

#if !defined(STM32F100xE)
/******************  Bit definition for FSMC_PCRx (x = 2 to 4) register  *******************/
#define  FSMC_PCRx_PWAITEN                   ((uint32_t)0x00000002)        /*!< Wait feature enable bit */
#define  FSMC_PCRx_PBKEN                     ((uint32_t)0x00000004)        /*!< PC Card/NAND Flash memory bank enable bit */
#define  FSMC_PCRx_PTYP                      ((uint32_t)0x00000008)        /*!< Memory type */

#define  FSMC_PCRx_PWID                      ((uint32_t)0x00000030)        /*!< PWID[1:0] bits (NAND Flash databus width) */
#define  FSMC_PCRx_PWID_0                    ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  FSMC_PCRx_PWID_1                    ((uint32_t)0x00000020)        /*!< Bit 1 */

#define  FSMC_PCRx_ECCEN                     ((uint32_t)0x00000040)        /*!< ECC computation logic enable bit */

#define  FSMC_PCRx_TCLR                      ((uint32_t)0x00001E00)        /*!< TCLR[3:0] bits (CLE to RE delay) */
#define  FSMC_PCRx_TCLR_0                    ((uint32_t)0x00000200)        /*!< Bit 0 */
#define  FSMC_PCRx_TCLR_1                    ((uint32_t)0x00000400)        /*!< Bit 1 */
#define  FSMC_PCRx_TCLR_2                    ((uint32_t)0x00000800)        /*!< Bit 2 */
#define  FSMC_PCRx_TCLR_3                    ((uint32_t)0x00001000)        /*!< Bit 3 */

#define  FSMC_PCRx_TAR                       ((uint32_t)0x0001E000)        /*!< TAR[3:0] bits (ALE to RE delay) */
#define  FSMC_PCRx_TAR_0                     ((uint32_t)0x00002000)        /*!< Bit 0 */
#define  FSMC_PCRx_TAR_1                     ((uint32_t)0x00004000)        /*!< Bit 1 */
#define  FSMC_PCRx_TAR_2                     ((uint32_t)0x00008000)        /*!< Bit 2 */
#define  FSMC_PCRx_TAR_3                     ((uint32_t)0x00010000)        /*!< Bit 3 */

#define  FSMC_PCRx_ECCPS                     ((uint32_t)0x000E0000)        /*!< ECCPS[1:0] bits (ECC page size) */
#define  FSMC_PCRx_ECCPS_0                   ((uint32_t)0x00020000)        /*!< Bit 0 */
#define  FSMC_PCRx_ECCPS_1                   ((uint32_t)0x00040000)        /*!< Bit 1 */
#define  FSMC_PCRx_ECCPS_2                   ((uint32_t)0x00080000)        /*!< Bit 2 */

/*******************  Bit definition for FSMC_SRx (x = 2 to 4) register  *******************/
#define  FSMC_SRx_IRS                        ((uint32_t)0x00000001)        /*!< Interrupt Rising Edge status */
#define  FSMC_SRx_ILS                        ((uint32_t)0x00000002)        /*!< Interrupt Level status */
#define  FSMC_SRx_IFS                        ((uint32_t)0x00000004)        /*!< Interrupt Falling Edge status */
#define  FSMC_SRx_IREN                       ((uint32_t)0x00000008)        /*!< Interrupt Rising Edge detection Enable bit */
#define  FSMC_SRx_ILEN                       ((uint32_t)0x00000010)        /*!< Interrupt Level detection Enable bit */
#define  FSMC_SRx_IFEN                       ((uint32_t)0x00000020)        /*!< Interrupt Falling Edge detection Enable bit */
#define  FSMC_SRx_FEMPT                      ((uint32_t)0x00000040)        /*!< FIFO empty */

/******************  Bit definition for FSMC_PMEMx (x = 2 to 4) register  ******************/
#define  FSMC_PMEMx_MEMSETx                  ((uint32_t)0x000000FF)        /*!< MEMSETx[7:0] bits (Common memory x setup time) */
#define  FSMC_PMEMx_MEMSETx_0                ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  FSMC_PMEMx_MEMSETx_1                ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  FSMC_PMEMx_MEMSETx_2                ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  FSMC_PMEMx_MEMSETx_3                ((uint32_t)0x00000008)        /*!< Bit 3 */
#define  FSMC_PMEMx_MEMSETx_4                ((uint32_t)0x00000010)        /*!< Bit 4 */
#define  FSMC_PMEMx_MEMSETx_5                ((uint32_t)0x00000020)        /*!< Bit 5 */
#define  FSMC_PMEMx_MEMSETx_6                ((uint32_t)0x00000040)        /*!< Bit 6 */
#define  FSMC_PMEMx_MEMSETx_7                ((uint32_t)0x00000080)        /*!< Bit 7 */

#define  FSMC_PMEMx_MEMWAITx                 ((uint32_t)0x0000FF00)        /*!< MEMWAITx[7:0] bits (Common memory x wait time) */
#define  FSMC_PMEMx_MEMWAIT2_0               ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  FSMC_PMEMx_MEMWAITx_1               ((uint32_t)0x00000200)        /*!< Bit 1 */
#define  FSMC_PMEMx_MEMWAITx_2               ((uint32_t)0x00000400)        /*!< Bit 2 */
#define  FSMC_PMEMx_MEMWAITx_3               ((uint32_t)0x00000800)        /*!< Bit 3 */
#define  FSMC_PMEMx_MEMWAITx_4               ((uint32_t)0x00001000)        /*!< Bit 4 */
#define  FSMC_PMEMx_MEMWAITx_5               ((uint32_t)0x00002000)        /*!< Bit 5 */
#define  FSMC_PMEMx_MEMWAITx_6               ((uint32_t)0x00004000)        /*!< Bit 6 */
#define  FSMC_PMEMx_MEMWAITx_7               ((uint32_t)0x00008000)        /*!< Bit 7 */

#define  FSMC_PMEMx_MEMHOLDx                 ((uint32_t)0x00FF0000)        /*!< MEMHOLDx[7:0] bits (Common memory x hold time) */
#define  FSMC_PMEMx_MEMHOLDx_0               ((uint32_t)0x00010000)        /*!< Bit 0 */
#define  FSMC_PMEMx_MEMHOLDx_1               ((uint32_t)0x00020000)        /*!< Bit 1 */
#define  FSMC_PMEMx_MEMHOLDx_2               ((uint32_t)0x00040000)        /*!< Bit 2 */
#define  FSMC_PMEMx_MEMHOLDx_3               ((uint32_t)0x00080000)        /*!< Bit 3 */
#define  FSMC_PMEMx_MEMHOLDx_4               ((uint32_t)0x00100000)        /*!< Bit 4 */
#define  FSMC_PMEMx_MEMHOLDx_5               ((uint32_t)0x00200000)        /*!< Bit 5 */
#define  FSMC_PMEMx_MEMHOLDx_6               ((uint32_t)0x00400000)        /*!< Bit 6 */
#define  FSMC_PMEMx_MEMHOLDx_7               ((uint32_t)0x00800000)        /*!< Bit 7 */

#define  FSMC_PMEMx_MEMHIZx                  ((uint32_t)0xFF000000)        /*!< MEMHIZx[7:0] bits (Common memory x databus HiZ time) */
#define  FSMC_PMEMx_MEMHIZx_0                ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  FSMC_PMEMx_MEMHIZx_1                ((uint32_t)0x02000000)        /*!< Bit 1 */
#define  FSMC_PMEMx_MEMHIZx_2                ((uint32_t)0x04000000)        /*!< Bit 2 */
#define  FSMC_PMEMx_MEMHIZx_3                ((uint32_t)0x08000000)        /*!< Bit 3 */
#define  FSMC_PMEMx_MEMHIZx_4                ((uint32_t)0x10000000)        /*!< Bit 4 */
#define  FSMC_PMEMx_MEMHIZx_5                ((uint32_t)0x20000000)        /*!< Bit 5 */
#define  FSMC_PMEMx_MEMHIZx_6                ((uint32_t)0x40000000)        /*!< Bit 6 */
#define  FSMC_PMEMx_MEMHIZx_7                ((uint32_t)0x80000000)        /*!< Bit 7 */

