zkntech/corelib/STM32Cube_FW_F1_V1.0.0RC1/CMSIS/Device/ST/STM32F1xx/Include/stm32f1xxxxx.h
/******************  Bit definition for FSMC_PATTx (x = 2 to 4) register  ******************/
#define  FSMC_PATTx_ATTSETx                  ((uint32_t)0x000000FF)        /*!< ATTSETx[7:0] bits (Attribute memory x setup time) */
#define  FSMC_PATTx_ATTSETx_0                ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  FSMC_PATTx_ATTSETx_1                ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  FSMC_PATTx_ATTSETx_2                ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  FSMC_PATTx_ATTSETx_3                ((uint32_t)0x00000008)        /*!< Bit 3 */
#define  FSMC_PATTx_ATTSETx_4                ((uint32_t)0x00000010)        /*!< Bit 4 */
#define  FSMC_PATTx_ATTSETx_5                ((uint32_t)0x00000020)        /*!< Bit 5 */
#define  FSMC_PATTx_ATTSETx_6                ((uint32_t)0x00000040)        /*!< Bit 6 */
#define  FSMC_PATTx_ATTSETx_7                ((uint32_t)0x00000080)        /*!< Bit 7 */

#define  FSMC_PATTx_ATTWAITx                 ((uint32_t)0x0000FF00)        /*!< ATTWAITx[7:0] bits (Attribute memory x wait time) */
#define  FSMC_PATTx_ATTWAITx_0               ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  FSMC_PATTx_ATTWAITx_1               ((uint32_t)0x00000200)        /*!< Bit 1 */
#define  FSMC_PATTx_ATTWAITx_2               ((uint32_t)0x00000400)        /*!< Bit 2 */
#define  FSMC_PATTx_ATTWAITx_3               ((uint32_t)0x00000800)        /*!< Bit 3 */
#define  FSMC_PATTx_ATTWAITx_4               ((uint32_t)0x00001000)        /*!< Bit 4 */
#define  FSMC_PATTx_ATTWAITx_5               ((uint32_t)0x00002000)        /*!< Bit 5 */
#define  FSMC_PATTx_ATTWAITx_6               ((uint32_t)0x00004000)        /*!< Bit 6 */
#define  FSMC_PATTx_ATTWAITx_7               ((uint32_t)0x00008000)        /*!< Bit 7 */

#define  FSMC_PATTx_ATTHOLDx                 ((uint32_t)0x00FF0000)        /*!< ATTHOLDx[7:0] bits (Attribute memory x hold time) */
#define  FSMC_PATTx_ATTHOLDx_0               ((uint32_t)0x00010000)        /*!< Bit 0 */
#define  FSMC_PATTx_ATTHOLDx_1               ((uint32_t)0x00020000)        /*!< Bit 1 */
#define  FSMC_PATTx_ATTHOLDx_2               ((uint32_t)0x00040000)        /*!< Bit 2 */
#define  FSMC_PATTx_ATTHOLDx_3               ((uint32_t)0x00080000)        /*!< Bit 3 */
#define  FSMC_PATTx_ATTHOLDx_4               ((uint32_t)0x00100000)        /*!< Bit 4 */
#define  FSMC_PATTx_ATTHOLDx_5               ((uint32_t)0x00200000)        /*!< Bit 5 */
#define  FSMC_PATTx_ATTHOLDx_6               ((uint32_t)0x00400000)        /*!< Bit 6 */
#define  FSMC_PATTx_ATTHOLDx_7               ((uint32_t)0x00800000)        /*!< Bit 7 */

#define  FSMC_PATTx_ATTHIZx                  ((uint32_t)0xFF000000)        /*!< ATTHIZx[7:0] bits (Attribute memory x databus HiZ time) */
#define  FSMC_PATTx_ATTHIZx_0                ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  FSMC_PATTx_ATTHIZx_1                ((uint32_t)0x02000000)        /*!< Bit 1 */
#define  FSMC_PATTx_ATTHIZx_2                ((uint32_t)0x04000000)        /*!< Bit 2 */
#define  FSMC_PATTx_ATTHIZx_3                ((uint32_t)0x08000000)        /*!< Bit 3 */
#define  FSMC_PATTx_ATTHIZx_4                ((uint32_t)0x10000000)        /*!< Bit 4 */
#define  FSMC_PATTx_ATTHIZx_5                ((uint32_t)0x20000000)        /*!< Bit 5 */
#define  FSMC_PATTx_ATTHIZx_6                ((uint32_t)0x40000000)        /*!< Bit 6 */
#define  FSMC_PATTx_ATTHIZx_7                ((uint32_t)0x80000000)        /*!< Bit 7 */

/******************  Bit definition for FSMC_PIO4 register  *******************/
#define  FSMC_PIO4_IOSET4                    ((uint32_t)0x000000FF)        /*!< IOSET4[7:0] bits (I/O 4 setup time) */
#define  FSMC_PIO4_IOSET4_0                  ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  FSMC_PIO4_IOSET4_1                  ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  FSMC_PIO4_IOSET4_2                  ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  FSMC_PIO4_IOSET4_3                  ((uint32_t)0x00000008)        /*!< Bit 3 */
#define  FSMC_PIO4_IOSET4_4                  ((uint32_t)0x00000010)        /*!< Bit 4 */
#define  FSMC_PIO4_IOSET4_5                  ((uint32_t)0x00000020)        /*!< Bit 5 */
#define  FSMC_PIO4_IOSET4_6                  ((uint32_t)0x00000040)        /*!< Bit 6 */
#define  FSMC_PIO4_IOSET4_7                  ((uint32_t)0x00000080)        /*!< Bit 7 */

#define  FSMC_PIO4_IOWAIT4                   ((uint32_t)0x0000FF00)        /*!< IOWAIT4[7:0] bits (I/O 4 wait time) */
#define  FSMC_PIO4_IOWAIT4_0                 ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  FSMC_PIO4_IOWAIT4_1                 ((uint32_t)0x00000200)        /*!< Bit 1 */
#define  FSMC_PIO4_IOWAIT4_2                 ((uint32_t)0x00000400)        /*!< Bit 2 */
#define  FSMC_PIO4_IOWAIT4_3                 ((uint32_t)0x00000800)        /*!< Bit 3 */
#define  FSMC_PIO4_IOWAIT4_4                 ((uint32_t)0x00001000)        /*!< Bit 4 */
#define  FSMC_PIO4_IOWAIT4_5                 ((uint32_t)0x00002000)        /*!< Bit 5 */
#define  FSMC_PIO4_IOWAIT4_6                 ((uint32_t)0x00004000)        /*!< Bit 6 */
#define  FSMC_PIO4_IOWAIT4_7                 ((uint32_t)0x00008000)        /*!< Bit 7 */

#define  FSMC_PIO4_IOHOLD4                   ((uint32_t)0x00FF0000)        /*!< IOHOLD4[7:0] bits (I/O 4 hold time) */
#define  FSMC_PIO4_IOHOLD4_0                 ((uint32_t)0x00010000)        /*!< Bit 0 */
#define  FSMC_PIO4_IOHOLD4_1                 ((uint32_t)0x00020000)        /*!< Bit 1 */
#define  FSMC_PIO4_IOHOLD4_2                 ((uint32_t)0x00040000)        /*!< Bit 2 */
#define  FSMC_PIO4_IOHOLD4_3                 ((uint32_t)0x00080000)        /*!< Bit 3 */
#define  FSMC_PIO4_IOHOLD4_4                 ((uint32_t)0x00100000)        /*!< Bit 4 */
#define  FSMC_PIO4_IOHOLD4_5                 ((uint32_t)0x00200000)        /*!< Bit 5 */
#define  FSMC_PIO4_IOHOLD4_6                 ((uint32_t)0x00400000)        /*!< Bit 6 */
#define  FSMC_PIO4_IOHOLD4_7                 ((uint32_t)0x00800000)        /*!< Bit 7 */

