zkntech/corelib/STM32Cube_FW_F1_V1.0.0RC1/CMSIS/Device/ST/STM32F1xx/Include/stm32f1xxxxx.h
/* Bit definition for Ethernet DMA Current Host Receive Descriptor Register */
#define ETH_DMACHRDR_HRDAP   ((uint32_t)0xFFFFFFFF)  /* Host receive descriptor address pointer */

/* Bit definition for Ethernet DMA Current Host Transmit Buffer Address Register */
#define ETH_DMACHTBAR_HTBAP  ((uint32_t)0xFFFFFFFF)  /* Host transmit buffer address pointer */

/* Bit definition for Ethernet DMA Current Host Receive Buffer Address Register */
#define ETH_DMACHRBAR_HRBAP  ((uint32_t)0xFFFFFFFF)  /* Host receive buffer address pointer */
#endif /* STM32F107xC */

#if defined (STM32F105xC) || defined (STM32F107xC)
/******************************************************************************/
/*                                                                            */
/*                                 USB_OTG                                    */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition forUSB_OTG_GOTGCTL register  ********************/
#define USB_OTG_GOTGCTL_SRQSCS               ((uint32_t)0x00000001)        /*!< Session request success */
#define USB_OTG_GOTGCTL_SRQ                  ((uint32_t)0x00000002)        /*!< Session request */
#define USB_OTG_GOTGCTL_HNGSCS               ((uint32_t)0x00000100)        /*!< Host negotiation success */
#define USB_OTG_GOTGCTL_HNPRQ                ((uint32_t)0x00000200)        /*!< HNP request */
#define USB_OTG_GOTGCTL_HSHNPEN              ((uint32_t)0x00000400)        /*!< Host set HNP enable */
#define USB_OTG_GOTGCTL_DHNPEN               ((uint32_t)0x00000800)        /*!< Device HNP enabled */
#define USB_OTG_GOTGCTL_CIDSTS               ((uint32_t)0x00010000)        /*!< Connector ID status */
#define USB_OTG_GOTGCTL_DBCT                 ((uint32_t)0x00020000)        /*!< Long/short debounce time */
#define USB_OTG_GOTGCTL_ASVLD                ((uint32_t)0x00040000)        /*!< A-session valid */
#define USB_OTG_GOTGCTL_BSVLD                ((uint32_t)0x00080000)        /*!< B-session valid */

/********************  Bit definition forUSB_OTG_HCFG register  ********************/

#define USB_OTG_HCFG_FSLSPCS                 ((uint32_t)0x00000003)        /*!< FS/LS PHY clock select */
#define USB_OTG_HCFG_FSLSPCS_0               ((uint32_t)0x00000001)        /*!<Bit 0 */
#define USB_OTG_HCFG_FSLSPCS_1               ((uint32_t)0x00000002)        /*!<Bit 1 */
#define USB_OTG_HCFG_FSLSS                   ((uint32_t)0x00000004)        /*!< FS- and LS-only support */

/********************  Bit definition forUSB_OTG_DCFG register  ********************/

#define USB_OTG_DCFG_DSPD                    ((uint32_t)0x00000003)        /*!< Device speed */
#define USB_OTG_DCFG_DSPD_0                  ((uint32_t)0x00000001)        /*!<Bit 0 */
#define USB_OTG_DCFG_DSPD_1                  ((uint32_t)0x00000002)        /*!<Bit 1 */
#define USB_OTG_DCFG_NZLSOHSK                ((uint32_t)0x00000004)        /*!< Nonzero-length status OUT handshake */

#define USB_OTG_DCFG_DAD                     ((uint32_t)0x000007F0)        /*!< Device address */
#define USB_OTG_DCFG_DAD_0                   ((uint32_t)0x00000010)        /*!<Bit 0 */
#define USB_OTG_DCFG_DAD_1                   ((uint32_t)0x00000020)        /*!<Bit 1 */
#define USB_OTG_DCFG_DAD_2                   ((uint32_t)0x00000040)        /*!<Bit 2 */
#define USB_OTG_DCFG_DAD_3                   ((uint32_t)0x00000080)        /*!<Bit 3 */
#define USB_OTG_DCFG_DAD_4                   ((uint32_t)0x00000100)        /*!<Bit 4 */
#define USB_OTG_DCFG_DAD_5                   ((uint32_t)0x00000200)        /*!<Bit 5 */
#define USB_OTG_DCFG_DAD_6                   ((uint32_t)0x00000400)        /*!<Bit 6 */

#define USB_OTG_DCFG_PFIVL                   ((uint32_t)0x00001800)        /*!< Periodic (micro)frame interval */
#define USB_OTG_DCFG_PFIVL_0                 ((uint32_t)0x00000800)        /*!<Bit 0 */
#define USB_OTG_DCFG_PFIVL_1                 ((uint32_t)0x00001000)        /*!<Bit 1 */

#define USB_OTG_DCFG_PERSCHIVL               ((uint32_t)0x03000000)        /*!< Periodic scheduling interval */
#define USB_OTG_DCFG_PERSCHIVL_0             ((uint32_t)0x01000000)        /*!<Bit 0 */
#define USB_OTG_DCFG_PERSCHIVL_1             ((uint32_t)0x02000000)        /*!<Bit 1 */

/********************  Bit definition forUSB_OTG_PCGCR register  ********************/
#define USB_OTG_PCGCR_STPPCLK                ((uint32_t)0x00000001)        /*!< Stop PHY clock */
#define USB_OTG_PCGCR_GATEHCLK               ((uint32_t)0x00000002)        /*!< Gate HCLK */
#define USB_OTG_PCGCR_PHYSUSP                ((uint32_t)0x00000010)        /*!< PHY suspended */

/********************  Bit definition forUSB_OTG_GOTGINT register  ******************/
#define USB_OTG_GOTGINT_SEDET                ((uint32_t)0x00000004)        /*!< Session end detected */
#define USB_OTG_GOTGINT_SRSSCHG              ((uint32_t)0x00000100)        /*!< Session request success status change */
#define USB_OTG_GOTGINT_HNSSCHG              ((uint32_t)0x00000200)        /*!< Host negotiation success status change */
#define USB_OTG_GOTGINT_HNGDET               ((uint32_t)0x00020000)        /*!< Host negotiation detected */
#define USB_OTG_GOTGINT_ADTOCHG              ((uint32_t)0x00040000)        /*!< A-device timeout change */
#define USB_OTG_GOTGINT_DBCDNE               ((uint32_t)0x00080000)        /*!< Debounce done */

/********************  Bit definition forUSB_OTG_DCTL register  ********************/
#define USB_OTG_DCTL_RWUSIG                  ((uint32_t)0x00000001)        /*!< Remote wakeup signaling */
#define USB_OTG_DCTL_SDIS                    ((uint32_t)0x00000002)        /*!< Soft disconnect */
#define USB_OTG_DCTL_GINSTS                  ((uint32_t)0x00000004)        /*!< Global IN NAK status */
#define USB_OTG_DCTL_GONSTS                  ((uint32_t)0x00000008)        /*!< Global OUT NAK status */

#define USB_OTG_DCTL_TCTL                    ((uint32_t)0x00000070)        /*!< Test control */
#define USB_OTG_DCTL_TCTL_0                  ((uint32_t)0x00000010)        /*!<Bit 0 */
#define USB_OTG_DCTL_TCTL_1                  ((uint32_t)0x00000020)        /*!<Bit 1 */
#define USB_OTG_DCTL_TCTL_2                  ((uint32_t)0x00000040)        /*!<Bit 2 */
#define USB_OTG_DCTL_SGINAK                  ((uint32_t)0x00000080)        /*!< Set global IN NAK */
#define USB_OTG_DCTL_CGINAK                  ((uint32_t)0x00000100)        /*!< Clear global IN NAK */
#define USB_OTG_DCTL_SGONAK                  ((uint32_t)0x00000200)        /*!< Set global OUT NAK */
#define USB_OTG_DCTL_CGONAK                  ((uint32_t)0x00000400)        /*!< Clear global OUT NAK */
#define USB_OTG_DCTL_POPRGDNE                ((uint32_t)0x00000800)        /*!< Power-on programming done */

/********************  Bit definition forUSB_OTG_HFIR register  ********************/
#define USB_OTG_HFIR_FRIVL                   ((uint32_t)0x0000FFFF)        /*!< Frame interval */

