zkntech/corelib/STM32Cube_FW_F1_V1.0.0RC1/CMSIS/Device/ST/STM32F1xx/Include/stm32f1xxxxx.h
/********************  Bit definition forUSB_OTG_HFNUM register  ********************/
#define USB_OTG_HFNUM_FRNUM                  ((uint32_t)0x0000FFFF)        /*!< Frame number */
#define USB_OTG_HFNUM_FTREM                  ((uint32_t)0xFFFF0000)        /*!< Frame time remaining */

/********************  Bit definition forUSB_OTG_DSTS register  ********************/
#define USB_OTG_DSTS_SUSPSTS                 ((uint32_t)0x00000001)        /*!< Suspend status */

#define USB_OTG_DSTS_ENUMSPD                 ((uint32_t)0x00000006)        /*!< Enumerated speed */
#define USB_OTG_DSTS_ENUMSPD_0               ((uint32_t)0x00000002)        /*!<Bit 0 */
#define USB_OTG_DSTS_ENUMSPD_1               ((uint32_t)0x00000004)        /*!<Bit 1 */
#define USB_OTG_DSTS_EERR                    ((uint32_t)0x00000008)        /*!< Erratic error */
#define USB_OTG_DSTS_FNSOF                   ((uint32_t)0x003FFF00)        /*!< Frame number of the received SOF */

/********************  Bit definition forUSB_OTG_GAHBCFG register  *****************/
#define USB_OTG_GAHBCFG_GINT                    ((uint32_t)0x00000001)     /*!< Global interrupt mask */

#define USB_OTG_GAHBCFG_HBSTLEN              ((uint32_t)0x0000001E)        /*!< Burst length/type */
#define USB_OTG_GAHBCFG_HBSTLEN_0            ((uint32_t)0x00000002)        /*!<Bit 0 */
#define USB_OTG_GAHBCFG_HBSTLEN_1            ((uint32_t)0x00000004)        /*!<Bit 1 */
#define USB_OTG_GAHBCFG_HBSTLEN_2            ((uint32_t)0x00000008)        /*!<Bit 2 */
#define USB_OTG_GAHBCFG_HBSTLEN_3            ((uint32_t)0x00000010)        /*!<Bit 3 */
#define USB_OTG_GAHBCFG_DMAEN                ((uint32_t)0x00000020)        /*!< DMA enable */
#define USB_OTG_GAHBCFG_TXFELVL              ((uint32_t)0x00000080)        /*!< TxFIFO empty level */
#define USB_OTG_GAHBCFG_PTXFELVL             ((uint32_t)0x00000100)        /*!< Periodic TxFIFO empty level */

/********************  Bit definition forUSB_OTG_GUSBCFG register  *****************/

#define USB_OTG_GUSBCFG_TOCAL                ((uint32_t)0x00000007)        /*!< FS timeout calibration */
#define USB_OTG_GUSBCFG_TOCAL_0              ((uint32_t)0x00000001)        /*!<Bit 0 */
#define USB_OTG_GUSBCFG_TOCAL_1              ((uint32_t)0x00000002)        /*!<Bit 1 */
#define USB_OTG_GUSBCFG_TOCAL_2              ((uint32_t)0x00000004)        /*!<Bit 2 */
#define USB_OTG_GUSBCFG_PHYSEL               ((uint32_t)0x00000040)        /*!< USB 2.0 high-speed ULPI PHY or USB 1.1 full-speed serial transceiver select */
#define USB_OTG_GUSBCFG_SRPCAP               ((uint32_t)0x00000100)        /*!< SRP-capable */
#define USB_OTG_GUSBCFG_HNPCAP               ((uint32_t)0x00000200)        /*!< HNP-capable */

#define USB_OTG_GUSBCFG_TRDT                 ((uint32_t)0x00003C00)        /*!< USB turnaround time */
#define USB_OTG_GUSBCFG_TRDT_0               ((uint32_t)0x00000400)        /*!<Bit 0 */
#define USB_OTG_GUSBCFG_TRDT_1               ((uint32_t)0x00000800)        /*!<Bit 1 */
#define USB_OTG_GUSBCFG_TRDT_2               ((uint32_t)0x00001000)        /*!<Bit 2 */
#define USB_OTG_GUSBCFG_TRDT_3               ((uint32_t)0x00002000)        /*!<Bit 3 */
#define USB_OTG_GUSBCFG_PHYLPCS              ((uint32_t)0x00008000)        /*!< PHY Low-power clock select */
#define USB_OTG_GUSBCFG_ULPIFSLS             ((uint32_t)0x00020000)        /*!< ULPI FS/LS select */
#define USB_OTG_GUSBCFG_ULPIAR               ((uint32_t)0x00040000)        /*!< ULPI Auto-resume */
#define USB_OTG_GUSBCFG_ULPICSM              ((uint32_t)0x00080000)        /*!< ULPI Clock SuspendM */
#define USB_OTG_GUSBCFG_ULPIEVBUSD           ((uint32_t)0x00100000)        /*!< ULPI External VBUS Drive */
#define USB_OTG_GUSBCFG_ULPIEVBUSI           ((uint32_t)0x00200000)        /*!< ULPI external VBUS indicator */
#define USB_OTG_GUSBCFG_TSDPS                ((uint32_t)0x00400000)        /*!< TermSel DLine pulsing selection */
#define USB_OTG_GUSBCFG_PCCI                 ((uint32_t)0x00800000)        /*!< Indicator complement */
#define USB_OTG_GUSBCFG_PTCI                 ((uint32_t)0x01000000)        /*!< Indicator pass through */
#define USB_OTG_GUSBCFG_ULPIIPD              ((uint32_t)0x02000000)        /*!< ULPI interface protect disable */
#define USB_OTG_GUSBCFG_FHMOD                ((uint32_t)0x20000000)        /*!< Forced host mode */
#define USB_OTG_GUSBCFG_FDMOD                ((uint32_t)0x40000000)        /*!< Forced peripheral mode */
#define USB_OTG_GUSBCFG_CTXPKT               ((uint32_t)0x80000000)        /*!< Corrupt Tx packet */

/********************  Bit definition forUSB_OTG_GRSTCTL register  *****************/
#define USB_OTG_GRSTCTL_CSRST                ((uint32_t)0x00000001)        /*!< Core soft reset */
#define USB_OTG_GRSTCTL_HSRST                ((uint32_t)0x00000002)        /*!< HCLK soft reset */
#define USB_OTG_GRSTCTL_FCRST                ((uint32_t)0x00000004)        /*!< Host frame counter reset */
#define USB_OTG_GRSTCTL_RXFFLSH              ((uint32_t)0x00000010)        /*!< RxFIFO flush */
#define USB_OTG_GRSTCTL_TXFFLSH              ((uint32_t)0x00000020)        /*!< TxFIFO flush */

#define USB_OTG_GRSTCTL_TXFNUM               ((uint32_t)0x000007C0)        /*!< TxFIFO number */
#define USB_OTG_GRSTCTL_TXFNUM_0             ((uint32_t)0x00000040)        /*!<Bit 0 */
#define USB_OTG_GRSTCTL_TXFNUM_1             ((uint32_t)0x00000080)        /*!<Bit 1 */
#define USB_OTG_GRSTCTL_TXFNUM_2             ((uint32_t)0x00000100)        /*!<Bit 2 */
#define USB_OTG_GRSTCTL_TXFNUM_3             ((uint32_t)0x00000200)        /*!<Bit 3 */
#define USB_OTG_GRSTCTL_TXFNUM_4             ((uint32_t)0x00000400)        /*!<Bit 4 */
#define USB_OTG_GRSTCTL_DMAREQ               ((uint32_t)0x40000000)        /*!< DMA request signal */
#define USB_OTG_GRSTCTL_AHBIDL               ((uint32_t)0x80000000)        /*!< AHB master idle */

/********************  Bit definition forUSB_OTG_DIEPMSK register  *****************/
#define USB_OTG_DIEPMSK_XFRCM                ((uint32_t)0x00000001)        /*!< Transfer completed interrupt mask */
#define USB_OTG_DIEPMSK_EPDM                 ((uint32_t)0x00000002)        /*!< Endpoint disabled interrupt mask */
#define USB_OTG_DIEPMSK_TOM                  ((uint32_t)0x00000008)        /*!< Timeout condition mask (nonisochronous endpoints) */
#define USB_OTG_DIEPMSK_ITTXFEMSK            ((uint32_t)0x00000010)        /*!< IN token received when TxFIFO empty mask */
#define USB_OTG_DIEPMSK_INEPNMM              ((uint32_t)0x00000020)        /*!< IN token received with EP mismatch mask */
#define USB_OTG_DIEPMSK_INEPNEM              ((uint32_t)0x00000040)        /*!< IN endpoint NAK effective mask */
#define USB_OTG_DIEPMSK_TXFURM               ((uint32_t)0x00000100)        /*!< FIFO underrun mask */
#define USB_OTG_DIEPMSK_BIM                  ((uint32_t)0x00000200)        /*!< BNA interrupt mask */

