zkntech/corelib/STM32Cube_FW_F1_V1.0.0RC1/CMSIS/Device/ST/STM32F1xx/Include/stm32f1xxxxx.h
/********************  Bit definition forUSB_OTG_HPTXSTS register  *****************/
#define USB_OTG_HPTXSTS_PTXFSAVL             ((uint32_t)0x0000FFFF)        /*!< Periodic transmit data FIFO space available */
                                          
#define USB_OTG_HPTXSTS_PTXQSAV              ((uint32_t)0x00FF0000)        /*!< Periodic transmit request queue space available */
#define USB_OTG_HPTXSTS_PTXQSAV_0            ((uint32_t)0x00010000)        /*!<Bit 0 */
#define USB_OTG_HPTXSTS_PTXQSAV_1            ((uint32_t)0x00020000)        /*!<Bit 1 */
#define USB_OTG_HPTXSTS_PTXQSAV_2            ((uint32_t)0x00040000)        /*!<Bit 2 */
#define USB_OTG_HPTXSTS_PTXQSAV_3            ((uint32_t)0x00080000)        /*!<Bit 3 */
#define USB_OTG_HPTXSTS_PTXQSAV_4            ((uint32_t)0x00100000)        /*!<Bit 4 */
#define USB_OTG_HPTXSTS_PTXQSAV_5            ((uint32_t)0x00200000)        /*!<Bit 5 */
#define USB_OTG_HPTXSTS_PTXQSAV_6            ((uint32_t)0x00400000)        /*!<Bit 6 */
#define USB_OTG_HPTXSTS_PTXQSAV_7            ((uint32_t)0x00800000)        /*!<Bit 7 */

#define USB_OTG_HPTXSTS_PTXQTOP              ((uint32_t)0xFF000000)        /*!< Top of the periodic transmit request queue */
#define USB_OTG_HPTXSTS_PTXQTOP_0            ((uint32_t)0x01000000)        /*!<Bit 0 */
#define USB_OTG_HPTXSTS_PTXQTOP_1            ((uint32_t)0x02000000)        /*!<Bit 1 */
#define USB_OTG_HPTXSTS_PTXQTOP_2            ((uint32_t)0x04000000)        /*!<Bit 2 */
#define USB_OTG_HPTXSTS_PTXQTOP_3            ((uint32_t)0x08000000)        /*!<Bit 3 */
#define USB_OTG_HPTXSTS_PTXQTOP_4            ((uint32_t)0x10000000)        /*!<Bit 4 */
#define USB_OTG_HPTXSTS_PTXQTOP_5            ((uint32_t)0x20000000)        /*!<Bit 5 */
#define USB_OTG_HPTXSTS_PTXQTOP_6            ((uint32_t)0x40000000)        /*!<Bit 6 */
#define USB_OTG_HPTXSTS_PTXQTOP_7            ((uint32_t)0x80000000)        /*!<Bit 7 */

/********************  Bit definition forUSB_OTG_HAINT register  *******************/
#define USB_OTG_HAINT_HAINT                  ((uint32_t)0x0000FFFF)        /*!< Channel interrupts */

/********************  Bit definition forUSB_OTG_DOEPMSK register  *****************/
#define USB_OTG_DOEPMSK_XFRCM                ((uint32_t)0x00000001)        /*!< Transfer completed interrupt mask */
#define USB_OTG_DOEPMSK_EPDM                 ((uint32_t)0x00000002)        /*!< Endpoint disabled interrupt mask */
#define USB_OTG_DOEPMSK_STUPM                ((uint32_t)0x00000008)        /*!< SETUP phase done mask */
#define USB_OTG_DOEPMSK_OTEPDM               ((uint32_t)0x00000010)        /*!< OUT token received when endpoint disabled mask */
#define USB_OTG_DOEPMSK_B2BSTUP              ((uint32_t)0x00000040)        /*!< Back-to-back SETUP packets received mask */
#define USB_OTG_DOEPMSK_OPEM                 ((uint32_t)0x00000100)        /*!< OUT packet error mask */
#define USB_OTG_DOEPMSK_BOIM                 ((uint32_t)0x00000200)        /*!< BNA interrupt mask */

/********************  Bit definition forUSB_OTG_GINTSTS register  *****************/
#define USB_OTG_GINTSTS_CMOD                 ((uint32_t)0x00000001)        /*!< Current mode of operation */
#define USB_OTG_GINTSTS_MMIS                 ((uint32_t)0x00000002)        /*!< Mode mismatch interrupt */
#define USB_OTG_GINTSTS_OTGINT               ((uint32_t)0x00000004)        /*!< OTG interrupt */
#define USB_OTG_GINTSTS_SOF                  ((uint32_t)0x00000008)        /*!< Start of frame */
#define USB_OTG_GINTSTS_RXFLVL               ((uint32_t)0x00000010)        /*!< RxFIFO nonempty */
#define USB_OTG_GINTSTS_NPTXFE               ((uint32_t)0x00000020)        /*!< Nonperiodic TxFIFO empty */
#define USB_OTG_GINTSTS_GINAKEFF             ((uint32_t)0x00000040)        /*!< Global IN nonperiodic NAK effective */
#define USB_OTG_GINTSTS_BOUTNAKEFF           ((uint32_t)0x00000080)        /*!< Global OUT NAK effective */
#define USB_OTG_GINTSTS_ESUSP                ((uint32_t)0x00000400)        /*!< Early suspend */
#define USB_OTG_GINTSTS_USBSUSP              ((uint32_t)0x00000800)        /*!< USB suspend */
#define USB_OTG_GINTSTS_USBRST               ((uint32_t)0x00001000)        /*!< USB reset */
#define USB_OTG_GINTSTS_ENUMDNE              ((uint32_t)0x00002000)        /*!< Enumeration done */
#define USB_OTG_GINTSTS_ISOODRP              ((uint32_t)0x00004000)        /*!< Isochronous OUT packet dropped interrupt */
#define USB_OTG_GINTSTS_EOPF                 ((uint32_t)0x00008000)        /*!< End of periodic frame interrupt */
#define USB_OTG_GINTSTS_IEPINT               ((uint32_t)0x00040000)        /*!< IN endpoint interrupt */
#define USB_OTG_GINTSTS_OEPINT               ((uint32_t)0x00080000)        /*!< OUT endpoint interrupt */
#define USB_OTG_GINTSTS_IISOIXFR             ((uint32_t)0x00100000)        /*!< Incomplete isochronous IN transfer */
#define USB_OTG_GINTSTS_PXFR_INCOMPISOOUT    ((uint32_t)0x00200000)        /*!< Incomplete periodic transfer */
#define USB_OTG_GINTSTS_DATAFSUSP            ((uint32_t)0x00400000)        /*!< Data fetch suspended */
#define USB_OTG_GINTSTS_HPRTINT              ((uint32_t)0x01000000)        /*!< Host port interrupt */
#define USB_OTG_GINTSTS_HCINT                ((uint32_t)0x02000000)        /*!< Host channels interrupt */
#define USB_OTG_GINTSTS_PTXFE                ((uint32_t)0x04000000)        /*!< Periodic TxFIFO empty */
#define USB_OTG_GINTSTS_CIDSCHG              ((uint32_t)0x10000000)        /*!< Connector ID status change */
#define USB_OTG_GINTSTS_DISCINT              ((uint32_t)0x20000000)        /*!< Disconnect detected interrupt */
#define USB_OTG_GINTSTS_SRQINT               ((uint32_t)0x40000000)        /*!< Session request/new session detected interrupt */
#define USB_OTG_GINTSTS_WKUINT               ((uint32_t)0x80000000)        /*!< Resume/remote wakeup detected interrupt */

/********************  Bit definition forUSB_OTG_GINTMSK register  *****************/
#define USB_OTG_GINTMSK_MMISM                ((uint32_t)0x00000002)        /*!< Mode mismatch interrupt mask */
#define USB_OTG_GINTMSK_OTGINT               ((uint32_t)0x00000004)        /*!< OTG interrupt mask */
#define USB_OTG_GINTMSK_SOFM                 ((uint32_t)0x00000008)        /*!< Start of frame mask */
#define USB_OTG_GINTMSK_RXFLVLM              ((uint32_t)0x00000010)        /*!< Receive FIFO nonempty mask */
#define USB_OTG_GINTMSK_NPTXFEM              ((uint32_t)0x00000020)        /*!< Nonperiodic TxFIFO empty mask */
#define USB_OTG_GINTMSK_GINAKEFFM            ((uint32_t)0x00000040)        /*!< Global nonperiodic IN NAK effective mask */
#define USB_OTG_GINTMSK_GONAKEFFM            ((uint32_t)0x00000080)        /*!< Global OUT NAK effective mask */
#define USB_OTG_GINTMSK_ESUSPM               ((uint32_t)0x00000400)        /*!< Early suspend mask */
#define USB_OTG_GINTMSK_USBSUSPM             ((uint32_t)0x00000800)        /*!< USB suspend mask */
#define USB_OTG_GINTMSK_USBRST               ((uint32_t)0x00001000)        /*!< USB reset mask */
#define USB_OTG_GINTMSK_ENUMDNEM             ((uint32_t)0x00002000)        /*!< Enumeration done mask */
#define USB_OTG_GINTMSK_ISOODRPM             ((uint32_t)0x00004000)        /*!< Isochronous OUT packet dropped interrupt mask */
#define USB_OTG_GINTMSK_EOPFM                ((uint32_t)0x00008000)        /*!< End of periodic frame interrupt mask */
#define USB_OTG_GINTMSK_EPMISM               ((uint32_t)0x00020000)        /*!< Endpoint mismatch interrupt mask */
#define USB_OTG_GINTMSK_IEPINT               ((uint32_t)0x00040000)        /*!< IN endpoints interrupt mask */
#define USB_OTG_GINTMSK_OEPINT               ((uint32_t)0x00080000)        /*!< OUT endpoints interrupt mask */
#define USB_OTG_GINTMSK_IISOIXFRM            ((uint32_t)0x00100000)        /*!< Incomplete isochronous IN transfer mask */
#define USB_OTG_GINTMSK_PXFRM_IISOOXFRM      ((uint32_t)0x00200000)        /*!< Incomplete periodic transfer mask */
#define USB_OTG_GINTMSK_FSUSPM               ((uint32_t)0x00400000)        /*!< Data fetch suspended mask */
#define USB_OTG_GINTMSK_PRTIM                ((uint32_t)0x01000000)        /*!< Host port interrupt mask */
#define USB_OTG_GINTMSK_HCIM                 ((uint32_t)0x02000000)        /*!< Host channels interrupt mask */
#define USB_OTG_GINTMSK_PTXFEM               ((uint32_t)0x04000000)        /*!< Periodic TxFIFO empty mask */
#define USB_OTG_GINTMSK_CIDSCHGM             ((uint32_t)0x10000000)        /*!< Connector ID status change mask */
#define USB_OTG_GINTMSK_DISCINT              ((uint32_t)0x20000000)        /*!< Disconnect detected interrupt mask */
#define USB_OTG_GINTMSK_SRQIM                ((uint32_t)0x40000000)        /*!< Session request/new session detected interrupt mask */
#define USB_OTG_GINTMSK_WUIM                 ((uint32_t)0x80000000)        /*!< Resume/remote wakeup detected interrupt mask */

