zkntech/corelib/STM32Cube_FW_F1_V1.0.0RC1/CMSIS/Device/ST/STM32F1xx/Include/stm32f1xxxxx.h
/********************  Bit definition forUSB_OTG_DAINT register  *******************/
#define USB_OTG_DAINT_IEPINT                 ((uint32_t)0x0000FFFF)        /*!< IN endpoint interrupt bits */
#define USB_OTG_DAINT_OEPINT                 ((uint32_t)0xFFFF0000)        /*!< OUT endpoint interrupt bits */

/********************  Bit definition forUSB_OTG_HAINTMSK register  ****************/
#define USB_OTG_HAINTMSK_HAINTM              ((uint32_t)0x0000FFFF)        /*!< Channel interrupt mask */

/********************  Bit definition for USB_OTG_GRXSTSP register  ****************/
#define USB_OTG_GRXSTSP_EPNUM                ((uint32_t)0x0000000F)        /*!< IN EP interrupt mask bits */
#define USB_OTG_GRXSTSP_BCNT                 ((uint32_t)0x00007FF0)        /*!< OUT EP interrupt mask bits */
#define USB_OTG_GRXSTSP_DPID                 ((uint32_t)0x00018000)        /*!< OUT EP interrupt mask bits */
#define USB_OTG_GRXSTSP_PKTSTS               ((uint32_t)0x001E0000)        /*!< OUT EP interrupt mask bits */

/********************  Bit definition forUSB_OTG_DAINTMSK register  ****************/
#define USB_OTG_DAINTMSK_IEPM                ((uint32_t)0x0000FFFF)        /*!< IN EP interrupt mask bits */
#define USB_OTG_DAINTMSK_OEPM                ((uint32_t)0xFFFF0000)        /*!< OUT EP interrupt mask bits */

/********************  Bit definition for OTG register  ****************************/
#define USB_OTG_CHNUM                        ((uint32_t)0x0000000F)        /*!< Channel number */
#define USB_OTG_CHNUM_0                      ((uint32_t)0x00000001)        /*!<Bit 0 */
#define USB_OTG_CHNUM_1                      ((uint32_t)0x00000002)        /*!<Bit 1 */
#define USB_OTG_CHNUM_2                      ((uint32_t)0x00000004)        /*!<Bit 2 */
#define USB_OTG_CHNUM_3                      ((uint32_t)0x00000008)        /*!<Bit 3 */
#define USB_OTG_BCNT                         ((uint32_t)0x00007FF0)        /*!< Byte count */

#define USB_OTG_DPID                         ((uint32_t)0x00018000)        /*!< Data PID */
#define USB_OTG_DPID_0                       ((uint32_t)0x00008000)        /*!<Bit 0 */
#define USB_OTG_DPID_1                       ((uint32_t)0x00010000)        /*!<Bit 1 */

#define USB_OTG_PKTSTS                       ((uint32_t)0x001E0000)        /*!< Packet status */
#define USB_OTG_PKTSTS_0                     ((uint32_t)0x00020000)        /*!<Bit 0 */
#define USB_OTG_PKTSTS_1                     ((uint32_t)0x00040000)        /*!<Bit 1 */
#define USB_OTG_PKTSTS_2                     ((uint32_t)0x00080000)        /*!<Bit 2 */
#define USB_OTG_PKTSTS_3                     ((uint32_t)0x00100000)        /*!<Bit 3 */

#define USB_OTG_EPNUM                        ((uint32_t)0x0000000F)        /*!< Endpoint number */
#define USB_OTG_EPNUM_0                      ((uint32_t)0x00000001)        /*!<Bit 0 */
#define USB_OTG_EPNUM_1                      ((uint32_t)0x00000002)        /*!<Bit 1 */
#define USB_OTG_EPNUM_2                      ((uint32_t)0x00000004)        /*!<Bit 2 */
#define USB_OTG_EPNUM_3                      ((uint32_t)0x00000008)        /*!<Bit 3 */

#define USB_OTG_FRMNUM                       ((uint32_t)0x01E00000)        /*!< Frame number */
#define USB_OTG_FRMNUM_0                     ((uint32_t)0x00200000)        /*!<Bit 0 */
#define USB_OTG_FRMNUM_1                     ((uint32_t)0x00400000)        /*!<Bit 1 */
#define USB_OTG_FRMNUM_2                     ((uint32_t)0x00800000)        /*!<Bit 2 */
#define USB_OTG_FRMNUM_3                     ((uint32_t)0x01000000)        /*!<Bit 3 */

/********************  Bit definition for OTG register  ****************************/
#define USB_OTG_CHNUM                        ((uint32_t)0x0000000F)        /*!< Channel number */
#define USB_OTG_CHNUM_0                      ((uint32_t)0x00000001)        /*!<Bit 0 */
#define USB_OTG_CHNUM_1                      ((uint32_t)0x00000002)        /*!<Bit 1 */
#define USB_OTG_CHNUM_2                      ((uint32_t)0x00000004)        /*!<Bit 2 */
#define USB_OTG_CHNUM_3                      ((uint32_t)0x00000008)        /*!<Bit 3 */
#define USB_OTG_BCNT                         ((uint32_t)0x00007FF0)        /*!< Byte count */

#define USB_OTG_DPID                         ((uint32_t)0x00018000)        /*!< Data PID */
#define USB_OTG_DPID_0                       ((uint32_t)0x00008000)        /*!<Bit 0 */
#define USB_OTG_DPID_1                       ((uint32_t)0x00010000)        /*!<Bit 1 */

#define USB_OTG_PKTSTS                       ((uint32_t)0x001E0000)        /*!< Packet status */
#define USB_OTG_PKTSTS_0                     ((uint32_t)0x00020000)        /*!<Bit 0 */
#define USB_OTG_PKTSTS_1                     ((uint32_t)0x00040000)        /*!<Bit 1 */
#define USB_OTG_PKTSTS_2                     ((uint32_t)0x00080000)        /*!<Bit 2 */
#define USB_OTG_PKTSTS_3                     ((uint32_t)0x00100000)        /*!<Bit 3 */

#define USB_OTG_EPNUM                        ((uint32_t)0x0000000F)        /*!< Endpoint number */
#define USB_OTG_EPNUM_0                      ((uint32_t)0x00000001)        /*!<Bit 0 */
#define USB_OTG_EPNUM_1                      ((uint32_t)0x00000002)        /*!<Bit 1 */
#define USB_OTG_EPNUM_2                      ((uint32_t)0x00000004)        /*!<Bit 2 */
#define USB_OTG_EPNUM_3                      ((uint32_t)0x00000008)        /*!<Bit 3 */

#define USB_OTG_FRMNUM                       ((uint32_t)0x01E00000)        /*!< Frame number */
#define USB_OTG_FRMNUM_0                     ((uint32_t)0x00200000)        /*!<Bit 0 */
#define USB_OTG_FRMNUM_1                     ((uint32_t)0x00400000)        /*!<Bit 1 */
#define USB_OTG_FRMNUM_2                     ((uint32_t)0x00800000)        /*!<Bit 2 */
#define USB_OTG_FRMNUM_3                     ((uint32_t)0x01000000)        /*!<Bit 3 */

/********************  Bit definition forUSB_OTG_GRXFSIZ register  *****************/
#define USB_OTG_GRXFSIZ_RXFD                 ((uint32_t)0x0000FFFF)        /*!< RxFIFO depth */

/********************  Bit definition forUSB_OTG_DVBUSDIS register  ****************/
#define USB_OTG_DVBUSDIS_VBUSDT              ((uint32_t)0x0000FFFF)        /*!< Device VBUS discharge time */

/********************  Bit definition for OTG register  ****************************/
#define USB_OTG_NPTXFSA                      ((uint32_t)0x0000FFFF)        /*!< Nonperiodic transmit RAM start address */
#define USB_OTG_NPTXFD                       ((uint32_t)0xFFFF0000)        /*!< Nonperiodic TxFIFO depth */
#define USB_OTG_TX0FSA                       ((uint32_t)0x0000FFFF)        /*!< Endpoint 0 transmit RAM start address */
#define USB_OTG_TX0FD                        ((uint32_t)0xFFFF0000)        /*!< Endpoint 0 TxFIFO depth */

/********************  Bit definition forUSB_OTG_DVBUSPULSE register  **************/
#define USB_OTG_DVBUSPULSE_DVBUSP            ((uint32_t)0x00000FFF)        /*!< Device VBUS pulsing time */

/********************  Bit definition forUSB_OTG_GNPTXSTS register  ****************/
#define USB_OTG_GNPTXSTS_NPTXFSAV            ((uint32_t)0x0000FFFF)        /*!< Nonperiodic TxFIFO space available */

#define USB_OTG_GNPTXSTS_NPTQXSAV            ((uint32_t)0x00FF0000)        /*!< Nonperiodic transmit request queue space available */
#define USB_OTG_GNPTXSTS_NPTQXSAV_0          ((uint32_t)0x00010000)        /*!<Bit 0 */
#define USB_OTG_GNPTXSTS_NPTQXSAV_1          ((uint32_t)0x00020000)        /*!<Bit 1 */
#define USB_OTG_GNPTXSTS_NPTQXSAV_2          ((uint32_t)0x00040000)        /*!<Bit 2 */
#define USB_OTG_GNPTXSTS_NPTQXSAV_3          ((uint32_t)0x00080000)        /*!<Bit 3 */
#define USB_OTG_GNPTXSTS_NPTQXSAV_4          ((uint32_t)0x00100000)        /*!<Bit 4 */
#define USB_OTG_GNPTXSTS_NPTQXSAV_5          ((uint32_t)0x00200000)        /*!<Bit 5 */
#define USB_OTG_GNPTXSTS_NPTQXSAV_6          ((uint32_t)0x00400000)        /*!<Bit 6 */
#define USB_OTG_GNPTXSTS_NPTQXSAV_7          ((uint32_t)0x00800000)        /*!<Bit 7 */

#define USB_OTG_GNPTXSTS_NPTXQTOP            ((uint32_t)0x7F000000)        /*!< Top of the nonperiodic transmit request queue */
#define USB_OTG_GNPTXSTS_NPTXQTOP_0          ((uint32_t)0x01000000)        /*!<Bit 0 */
#define USB_OTG_GNPTXSTS_NPTXQTOP_1          ((uint32_t)0x02000000)        /*!<Bit 1 */
#define USB_OTG_GNPTXSTS_NPTXQTOP_2          ((uint32_t)0x04000000)        /*!<Bit 2 */
#define USB_OTG_GNPTXSTS_NPTXQTOP_3          ((uint32_t)0x08000000)        /*!<Bit 3 */
#define USB_OTG_GNPTXSTS_NPTXQTOP_4          ((uint32_t)0x10000000)        /*!<Bit 4 */
#define USB_OTG_GNPTXSTS_NPTXQTOP_5          ((uint32_t)0x20000000)        /*!<Bit 5 */
#define USB_OTG_GNPTXSTS_NPTXQTOP_6          ((uint32_t)0x40000000)        /*!<Bit 6 */

