zkntech/corelib/STM32Cube_FW_F1_V1.0.0RC1/CMSIS/Device/ST/STM32F1xx/Include/stm32f1xxxxx.h
/********************  Bit definition forUSB_OTG_DTHRCTL register  *****************/
#define USB_OTG_DTHRCTL_NONISOTHREN          ((uint32_t)0x00000001)        /*!< Nonisochronous IN endpoints threshold enable */
#define USB_OTG_DTHRCTL_ISOTHREN             ((uint32_t)0x00000002)        /*!< ISO IN endpoint threshold enable */

#define USB_OTG_DTHRCTL_TXTHRLEN             ((uint32_t)0x000007FC)        /*!< Transmit threshold length */
#define USB_OTG_DTHRCTL_TXTHRLEN_0           ((uint32_t)0x00000004)        /*!<Bit 0 */
#define USB_OTG_DTHRCTL_TXTHRLEN_1           ((uint32_t)0x00000008)        /*!<Bit 1 */
#define USB_OTG_DTHRCTL_TXTHRLEN_2           ((uint32_t)0x00000010)        /*!<Bit 2 */
#define USB_OTG_DTHRCTL_TXTHRLEN_3           ((uint32_t)0x00000020)        /*!<Bit 3 */
#define USB_OTG_DTHRCTL_TXTHRLEN_4           ((uint32_t)0x00000040)        /*!<Bit 4 */
#define USB_OTG_DTHRCTL_TXTHRLEN_5           ((uint32_t)0x00000080)        /*!<Bit 5 */
#define USB_OTG_DTHRCTL_TXTHRLEN_6           ((uint32_t)0x00000100)        /*!<Bit 6 */
#define USB_OTG_DTHRCTL_TXTHRLEN_7           ((uint32_t)0x00000200)        /*!<Bit 7 */
#define USB_OTG_DTHRCTL_TXTHRLEN_8           ((uint32_t)0x00000400)        /*!<Bit 8 */
#define USB_OTG_DTHRCTL_RXTHREN              ((uint32_t)0x00010000)        /*!< Receive threshold enable */

#define USB_OTG_DTHRCTL_RXTHRLEN             ((uint32_t)0x03FE0000)        /*!< Receive threshold length */
#define USB_OTG_DTHRCTL_RXTHRLEN_0           ((uint32_t)0x00020000)        /*!<Bit 0 */
#define USB_OTG_DTHRCTL_RXTHRLEN_1           ((uint32_t)0x00040000)        /*!<Bit 1 */
#define USB_OTG_DTHRCTL_RXTHRLEN_2           ((uint32_t)0x00080000)        /*!<Bit 2 */
#define USB_OTG_DTHRCTL_RXTHRLEN_3           ((uint32_t)0x00100000)        /*!<Bit 3 */
#define USB_OTG_DTHRCTL_RXTHRLEN_4           ((uint32_t)0x00200000)        /*!<Bit 4 */
#define USB_OTG_DTHRCTL_RXTHRLEN_5           ((uint32_t)0x00400000)        /*!<Bit 5 */
#define USB_OTG_DTHRCTL_RXTHRLEN_6           ((uint32_t)0x00800000)        /*!<Bit 6 */
#define USB_OTG_DTHRCTL_RXTHRLEN_7           ((uint32_t)0x01000000)        /*!<Bit 7 */
#define USB_OTG_DTHRCTL_RXTHRLEN_8           ((uint32_t)0x02000000)        /*!<Bit 8 */
#define USB_OTG_DTHRCTL_ARPEN                ((uint32_t)0x08000000)        /*!< Arbiter parking enable */

/********************  Bit definition forUSB_OTG_DIEPEMPMSK register  **************/
#define USB_OTG_DIEPEMPMSK_INEPTXFEM         ((uint32_t)0x0000FFFF)        /*!< IN EP Tx FIFO empty interrupt mask bits */

/********************  Bit definition forUSB_OTG_DEACHINT register  ****************/
#define USB_OTG_DEACHINT_IEP1INT             ((uint32_t)0x00000002)        /*!< IN endpoint 1interrupt bit */
#define USB_OTG_DEACHINT_OEP1INT             ((uint32_t)0x00020000)        /*!< OUT endpoint 1 interrupt bit */

/********************  Bit definition forUSB_OTG_GCCFG register  *******************/
#define USB_OTG_GCCFG_PWRDWN                 ((uint32_t)0x00010000)        /*!< Power down */
#define USB_OTG_GCCFG_I2CPADEN               ((uint32_t)0x00020000)        /*!< Enable I2C bus connection for the external I2C PHY interface */
#define USB_OTG_GCCFG_VBUSASEN               ((uint32_t)0x00040000)        /*!< Enable the VBUS sensing device */
#define USB_OTG_GCCFG_VBUSBSEN               ((uint32_t)0x00080000)        /*!< Enable the VBUS sensing device */
#define USB_OTG_GCCFG_SOFOUTEN               ((uint32_t)0x00100000)        /*!< SOF output enable */
#define USB_OTG_GCCFG_NOVBUSSENS             ((uint32_t)0x00200000)        /*!< VBUS sensing disable option */

/********************  Bit definition forUSB_OTG_DEACHINTMSK register  *************/
#define USB_OTG_DEACHINTMSK_IEP1INTM         ((uint32_t)0x00000002)        /*!< IN Endpoint 1 interrupt mask bit */
#define USB_OTG_DEACHINTMSK_OEP1INTM         ((uint32_t)0x00020000)        /*!< OUT Endpoint 1 interrupt mask bit */

/********************  Bit definition forUSB_OTG_CID register  *********************/
#define USB_OTG_CID_PRODUCT_ID               ((uint32_t)0xFFFFFFFF)        /*!< Product ID field */

/********************  Bit definition forUSB_OTG_DIEPEACHMSK1 register  ************/
#define USB_OTG_DIEPEACHMSK1_XFRCM           ((uint32_t)0x00000001)        /*!< Transfer completed interrupt mask */
#define USB_OTG_DIEPEACHMSK1_EPDM            ((uint32_t)0x00000002)        /*!< Endpoint disabled interrupt mask */
#define USB_OTG_DIEPEACHMSK1_TOM             ((uint32_t)0x00000008)        /*!< Timeout condition mask (nonisochronous endpoints) */
#define USB_OTG_DIEPEACHMSK1_ITTXFEMSK       ((uint32_t)0x00000010)        /*!< IN token received when TxFIFO empty mask */
#define USB_OTG_DIEPEACHMSK1_INEPNMM         ((uint32_t)0x00000020)        /*!< IN token received with EP mismatch mask */
#define USB_OTG_DIEPEACHMSK1_INEPNEM         ((uint32_t)0x00000040)        /*!< IN endpoint NAK effective mask */
#define USB_OTG_DIEPEACHMSK1_TXFURM          ((uint32_t)0x00000100)        /*!< FIFO underrun mask */
#define USB_OTG_DIEPEACHMSK1_BIM             ((uint32_t)0x00000200)        /*!< BNA interrupt mask */
#define USB_OTG_DIEPEACHMSK1_NAKM            ((uint32_t)0x00002000)        /*!< NAK interrupt mask */

/********************  Bit definition forUSB_OTG_HPRT register  ********************/
#define USB_OTG_HPRT_PCSTS                   ((uint32_t)0x00000001)        /*!< Port connect status */
#define USB_OTG_HPRT_PCDET                   ((uint32_t)0x00000002)        /*!< Port connect detected */
#define USB_OTG_HPRT_PENA                    ((uint32_t)0x00000004)        /*!< Port enable */
#define USB_OTG_HPRT_PENCHNG                 ((uint32_t)0x00000008)        /*!< Port enable/disable change */
#define USB_OTG_HPRT_POCA                    ((uint32_t)0x00000010)        /*!< Port overcurrent active */
#define USB_OTG_HPRT_POCCHNG                 ((uint32_t)0x00000020)        /*!< Port overcurrent change */
#define USB_OTG_HPRT_PRES                    ((uint32_t)0x00000040)        /*!< Port resume */
#define USB_OTG_HPRT_PSUSP                   ((uint32_t)0x00000080)        /*!< Port suspend */
#define USB_OTG_HPRT_PRST                    ((uint32_t)0x00000100)        /*!< Port reset */

#define USB_OTG_HPRT_PLSTS                   ((uint32_t)0x00000C00)        /*!< Port line status */
#define USB_OTG_HPRT_PLSTS_0                 ((uint32_t)0x00000400)        /*!<Bit 0 */
#define USB_OTG_HPRT_PLSTS_1                 ((uint32_t)0x00000800)        /*!<Bit 1 */
#define USB_OTG_HPRT_PPWR                    ((uint32_t)0x00001000)        /*!< Port power */

