zkntech/corelib/STM32Cube_FW_F1_V1.0.0RC1/CMSIS/Device/ST/STM32F1xx/Include/stm32f1xxxxx.h
#define USB_OTG_HPRT_PTCTL                   ((uint32_t)0x0001E000)        /*!< Port test control */
#define USB_OTG_HPRT_PTCTL_0                 ((uint32_t)0x00002000)        /*!<Bit 0 */
#define USB_OTG_HPRT_PTCTL_1                 ((uint32_t)0x00004000)        /*!<Bit 1 */
#define USB_OTG_HPRT_PTCTL_2                 ((uint32_t)0x00008000)        /*!<Bit 2 */
#define USB_OTG_HPRT_PTCTL_3                 ((uint32_t)0x00010000)        /*!<Bit 3 */

#define USB_OTG_HPRT_PSPD                    ((uint32_t)0x00060000)        /*!< Port speed */
#define USB_OTG_HPRT_PSPD_0                  ((uint32_t)0x00020000)        /*!<Bit 0 */
#define USB_OTG_HPRT_PSPD_1                  ((uint32_t)0x00040000)        /*!<Bit 1 */

/********************  Bit definition forUSB_OTG_DOEPEACHMSK1 register  ************/
#define USB_OTG_DOEPEACHMSK1_XFRCM           ((uint32_t)0x00000001)        /*!< Transfer completed interrupt mask */
#define USB_OTG_DOEPEACHMSK1_EPDM            ((uint32_t)0x00000002)        /*!< Endpoint disabled interrupt mask */
#define USB_OTG_DOEPEACHMSK1_TOM             ((uint32_t)0x00000008)        /*!< Timeout condition mask */
#define USB_OTG_DOEPEACHMSK1_ITTXFEMSK       ((uint32_t)0x00000010)        /*!< IN token received when TxFIFO empty mask */
#define USB_OTG_DOEPEACHMSK1_INEPNMM         ((uint32_t)0x00000020)        /*!< IN token received with EP mismatch mask */
#define USB_OTG_DOEPEACHMSK1_INEPNEM         ((uint32_t)0x00000040)        /*!< IN endpoint NAK effective mask */
#define USB_OTG_DOEPEACHMSK1_TXFURM          ((uint32_t)0x00000100)        /*!< OUT packet error mask */
#define USB_OTG_DOEPEACHMSK1_BIM             ((uint32_t)0x00000200)        /*!< BNA interrupt mask */
#define USB_OTG_DOEPEACHMSK1_BERRM           ((uint32_t)0x00001000)        /*!< Bubble error interrupt mask */
#define USB_OTG_DOEPEACHMSK1_NAKM            ((uint32_t)0x00002000)        /*!< NAK interrupt mask */
#define USB_OTG_DOEPEACHMSK1_NYETM           ((uint32_t)0x00004000)        /*!< NYET interrupt mask */

/********************  Bit definition forUSB_OTG_HPTXFSIZ register  ****************/
#define USB_OTG_HPTXFSIZ_PTXSA               ((uint32_t)0x0000FFFF)        /*!< Host periodic TxFIFO start address */
#define USB_OTG_HPTXFSIZ_PTXFD               ((uint32_t)0xFFFF0000)        /*!< Host periodic TxFIFO depth */

/********************  Bit definition forUSB_OTG_DIEPCTL register  *****************/
#define USB_OTG_DIEPCTL_MPSIZ                ((uint32_t)0x000007FF)        /*!< Maximum packet size */
#define USB_OTG_DIEPCTL_USBAEP               ((uint32_t)0x00008000)        /*!< USB active endpoint */
#define USB_OTG_DIEPCTL_EONUM_DPID           ((uint32_t)0x00010000)        /*!< Even/odd frame */
#define USB_OTG_DIEPCTL_NAKSTS               ((uint32_t)0x00020000)        /*!< NAK status */

#define USB_OTG_DIEPCTL_EPTYP                ((uint32_t)0x000C0000)        /*!< Endpoint type */
#define USB_OTG_DIEPCTL_EPTYP_0              ((uint32_t)0x00040000)        /*!<Bit 0 */
#define USB_OTG_DIEPCTL_EPTYP_1              ((uint32_t)0x00080000)        /*!<Bit 1 */
#define USB_OTG_DIEPCTL_STALL                ((uint32_t)0x00200000)        /*!< STALL handshake */

#define USB_OTG_DIEPCTL_TXFNUM               ((uint32_t)0x03C00000)        /*!< TxFIFO number */
#define USB_OTG_DIEPCTL_TXFNUM_0             ((uint32_t)0x00400000)        /*!<Bit 0 */
#define USB_OTG_DIEPCTL_TXFNUM_1             ((uint32_t)0x00800000)        /*!<Bit 1 */
#define USB_OTG_DIEPCTL_TXFNUM_2             ((uint32_t)0x01000000)        /*!<Bit 2 */
#define USB_OTG_DIEPCTL_TXFNUM_3             ((uint32_t)0x02000000)        /*!<Bit 3 */
#define USB_OTG_DIEPCTL_CNAK                 ((uint32_t)0x04000000)        /*!< Clear NAK */
#define USB_OTG_DIEPCTL_SNAK                 ((uint32_t)0x08000000)        /*!< Set NAK */
#define USB_OTG_DIEPCTL_SD0PID_SEVNFRM       ((uint32_t)0x10000000)        /*!< Set DATA0 PID */
#define USB_OTG_DIEPCTL_SODDFRM              ((uint32_t)0x20000000)        /*!< Set odd frame */
#define USB_OTG_DIEPCTL_EPDIS                ((uint32_t)0x40000000)        /*!< Endpoint disable */
#define USB_OTG_DIEPCTL_EPENA                ((uint32_t)0x80000000)        /*!< Endpoint enable */

/********************  Bit definition forUSB_OTG_HCCHAR register  ******************/
#define USB_OTG_HCCHAR_MPSIZ                 ((uint32_t)0x000007FF)        /*!< Maximum packet size */

#define USB_OTG_HCCHAR_EPNUM                 ((uint32_t)0x00007800)        /*!< Endpoint number */
#define USB_OTG_HCCHAR_EPNUM_0               ((uint32_t)0x00000800)        /*!<Bit 0 */
#define USB_OTG_HCCHAR_EPNUM_1               ((uint32_t)0x00001000)        /*!<Bit 1 */
#define USB_OTG_HCCHAR_EPNUM_2               ((uint32_t)0x00002000)        /*!<Bit 2 */
#define USB_OTG_HCCHAR_EPNUM_3               ((uint32_t)0x00004000)        /*!<Bit 3 */
#define USB_OTG_HCCHAR_EPDIR                 ((uint32_t)0x00008000)        /*!< Endpoint direction */
#define USB_OTG_HCCHAR_LSDEV                 ((uint32_t)0x00020000)        /*!< Low-speed device */

#define USB_OTG_HCCHAR_EPTYP                 ((uint32_t)0x000C0000)        /*!< Endpoint type */
#define USB_OTG_HCCHAR_EPTYP_0               ((uint32_t)0x00040000)        /*!<Bit 0 */
#define USB_OTG_HCCHAR_EPTYP_1               ((uint32_t)0x00080000)        /*!<Bit 1 */
                                      
#define USB_OTG_HCCHAR_MC                    ((uint32_t)0x00300000)        /*!< Multi Count (MC) / Error Count (EC) */
#define USB_OTG_HCCHAR_MC_0                  ((uint32_t)0x00100000)        /*!<Bit 0 */
#define USB_OTG_HCCHAR_MC_1                  ((uint32_t)0x00200000)        /*!<Bit 1 */

#define USB_OTG_HCCHAR_DAD                   ((uint32_t)0x1FC00000)        /*!< Device address */
#define USB_OTG_HCCHAR_DAD_0                 ((uint32_t)0x00400000)        /*!<Bit 0 */
#define USB_OTG_HCCHAR_DAD_1                 ((uint32_t)0x00800000)        /*!<Bit 1 */
#define USB_OTG_HCCHAR_DAD_2                 ((uint32_t)0x01000000)        /*!<Bit 2 */
#define USB_OTG_HCCHAR_DAD_3                 ((uint32_t)0x02000000)        /*!<Bit 3 */
#define USB_OTG_HCCHAR_DAD_4                 ((uint32_t)0x04000000)        /*!<Bit 4 */
#define USB_OTG_HCCHAR_DAD_5                 ((uint32_t)0x08000000)        /*!<Bit 5 */
#define USB_OTG_HCCHAR_DAD_6                 ((uint32_t)0x10000000)        /*!<Bit 6 */
#define USB_OTG_HCCHAR_ODDFRM                ((uint32_t)0x20000000)        /*!< Odd frame */
#define USB_OTG_HCCHAR_CHDIS                 ((uint32_t)0x40000000)        /*!< Channel disable */
#define USB_OTG_HCCHAR_CHENA                 ((uint32_t)0x80000000)        /*!< Channel enable */

/********************  Bit definition forUSB_OTG_HCSPLT register  ******************/

#define USB_OTG_HCSPLT_PRTADDR               ((uint32_t)0x0000007F)        /*!< Port address */
#define USB_OTG_HCSPLT_PRTADDR_0             ((uint32_t)0x00000001)        /*!<Bit 0 */
#define USB_OTG_HCSPLT_PRTADDR_1             ((uint32_t)0x00000002)        /*!<Bit 1 */
#define USB_OTG_HCSPLT_PRTADDR_2             ((uint32_t)0x00000004)        /*!<Bit 2 */
#define USB_OTG_HCSPLT_PRTADDR_3             ((uint32_t)0x00000008)        /*!<Bit 3 */
#define USB_OTG_HCSPLT_PRTADDR_4             ((uint32_t)0x00000010)        /*!<Bit 4 */
#define USB_OTG_HCSPLT_PRTADDR_5             ((uint32_t)0x00000020)        /*!<Bit 5 */
#define USB_OTG_HCSPLT_PRTADDR_6             ((uint32_t)0x00000040)        /*!<Bit 6 */

#define USB_OTG_HCSPLT_HUBADDR               ((uint32_t)0x00003F80)        /*!< Hub address */
#define USB_OTG_HCSPLT_HUBADDR_0             ((uint32_t)0x00000080)        /*!<Bit 0 */
#define USB_OTG_HCSPLT_HUBADDR_1             ((uint32_t)0x00000100)        /*!<Bit 1 */
#define USB_OTG_HCSPLT_HUBADDR_2             ((uint32_t)0x00000200)        /*!<Bit 2 */
#define USB_OTG_HCSPLT_HUBADDR_3             ((uint32_t)0x00000400)        /*!<Bit 3 */
#define USB_OTG_HCSPLT_HUBADDR_4             ((uint32_t)0x00000800)        /*!<Bit 4 */
#define USB_OTG_HCSPLT_HUBADDR_5             ((uint32_t)0x00001000)        /*!<Bit 5 */
#define USB_OTG_HCSPLT_HUBADDR_6             ((uint32_t)0x00002000)        /*!<Bit 6 */

#define USB_OTG_HCSPLT_XACTPOS               ((uint32_t)0x0000C000)        /*!< XACTPOS */
#define USB_OTG_HCSPLT_XACTPOS_0             ((uint32_t)0x00004000)        /*!<Bit 0 */
#define USB_OTG_HCSPLT_XACTPOS_1             ((uint32_t)0x00008000)        /*!<Bit 1 */
#define USB_OTG_HCSPLT_COMPLSPLT             ((uint32_t)0x00010000)        /*!< Do complete split */
#define USB_OTG_HCSPLT_SPLITEN               ((uint32_t)0x80000000)        /*!< Split enable */

