zkntech/corelib/STM32Cube_FW_F1_V1.0.0RC1/CMSIS/Device/ST/STM32F1xx/Include/stm32f1xxxxx.h
/********************  Bit definition forUSB_OTG_HCINT register  *******************/
#define USB_OTG_HCINT_XFRC                   ((uint32_t)0x00000001)        /*!< Transfer completed */
#define USB_OTG_HCINT_CHH                    ((uint32_t)0x00000002)        /*!< Channel halted */
#define USB_OTG_HCINT_AHBERR                 ((uint32_t)0x00000004)        /*!< AHB error */
#define USB_OTG_HCINT_STALL                  ((uint32_t)0x00000008)        /*!< STALL response received interrupt */
#define USB_OTG_HCINT_NAK                    ((uint32_t)0x00000010)        /*!< NAK response received interrupt */
#define USB_OTG_HCINT_ACK                    ((uint32_t)0x00000020)        /*!< ACK response received/transmitted interrupt */
#define USB_OTG_HCINT_NYET                   ((uint32_t)0x00000040)        /*!< Response received interrupt */
#define USB_OTG_HCINT_TXERR                  ((uint32_t)0x00000080)        /*!< Transaction error */
#define USB_OTG_HCINT_BBERR                  ((uint32_t)0x00000100)        /*!< Babble error */
#define USB_OTG_HCINT_FRMOR                  ((uint32_t)0x00000200)        /*!< Frame overrun */
#define USB_OTG_HCINT_DTERR                  ((uint32_t)0x00000400)        /*!< Data toggle error */

/********************  Bit definition forUSB_OTG_DIEPINT register  *****************/
#define USB_OTG_DIEPINT_XFRC                 ((uint32_t)0x00000001)        /*!< Transfer completed interrupt */
#define USB_OTG_DIEPINT_EPDISD               ((uint32_t)0x00000002)        /*!< Endpoint disabled interrupt */
#define USB_OTG_DIEPINT_TOC                  ((uint32_t)0x00000008)        /*!< Timeout condition */
#define USB_OTG_DIEPINT_ITTXFE               ((uint32_t)0x00000010)        /*!< IN token received when TxFIFO is empty */
#define USB_OTG_DIEPINT_INEPNE               ((uint32_t)0x00000040)        /*!< IN endpoint NAK effective */
#define USB_OTG_DIEPINT_TXFE                 ((uint32_t)0x00000080)        /*!< Transmit FIFO empty */
#define USB_OTG_DIEPINT_TXFIFOUDRN           ((uint32_t)0x00000100)        /*!< Transmit Fifo Underrun */
#define USB_OTG_DIEPINT_BNA                  ((uint32_t)0x00000200)        /*!< Buffer not available interrupt */
#define USB_OTG_DIEPINT_PKTDRPSTS            ((uint32_t)0x00000800)        /*!< Packet dropped status */
#define USB_OTG_DIEPINT_BERR                 ((uint32_t)0x00001000)        /*!< Babble error interrupt */
#define USB_OTG_DIEPINT_NAK                  ((uint32_t)0x00002000)        /*!< NAK interrupt */

/********************  Bit definition forUSB_OTG_HCINTMSK register  ****************/
#define USB_OTG_HCINTMSK_XFRCM               ((uint32_t)0x00000001)        /*!< Transfer completed mask */
#define USB_OTG_HCINTMSK_CHHM                ((uint32_t)0x00000002)        /*!< Channel halted mask */
#define USB_OTG_HCINTMSK_AHBERR              ((uint32_t)0x00000004)        /*!< AHB error */
#define USB_OTG_HCINTMSK_STALLM              ((uint32_t)0x00000008)        /*!< STALL response received interrupt mask */
#define USB_OTG_HCINTMSK_NAKM                ((uint32_t)0x00000010)        /*!< NAK response received interrupt mask */
#define USB_OTG_HCINTMSK_ACKM                ((uint32_t)0x00000020)        /*!< ACK response received/transmitted interrupt mask */
#define USB_OTG_HCINTMSK_NYET                ((uint32_t)0x00000040)        /*!< response received interrupt mask */
#define USB_OTG_HCINTMSK_TXERRM              ((uint32_t)0x00000080)        /*!< Transaction error mask */
#define USB_OTG_HCINTMSK_BBERRM              ((uint32_t)0x00000100)        /*!< Babble error mask */
#define USB_OTG_HCINTMSK_FRMORM              ((uint32_t)0x00000200)        /*!< Frame overrun mask */
#define USB_OTG_HCINTMSK_DTERRM              ((uint32_t)0x00000400)        /*!< Data toggle error mask */

/********************  Bit definition for USB_OTG_DIEPTSIZ register  ***************/
#define USB_OTG_DIEPTSIZ_XFRSIZ              ((uint32_t)0x0007FFFF)        /*!< Transfer size */
#define USB_OTG_DIEPTSIZ_PKTCNT              ((uint32_t)0x1FF80000)        /*!< Packet count */
#define USB_OTG_DIEPTSIZ_MULCNT              ((uint32_t)0x60000000)        /*!< Packet count */

/********************  Bit definition forUSB_OTG_HCTSIZ register  ******************/
#define USB_OTG_HCTSIZ_XFRSIZ                ((uint32_t)0x0007FFFF)        /*!< Transfer size */
#define USB_OTG_HCTSIZ_PKTCNT                ((uint32_t)0x1FF80000)        /*!< Packet count */
#define USB_OTG_HCTSIZ_DOPING                ((uint32_t)0x80000000)        /*!< Do PING */
#define USB_OTG_HCTSIZ_DPID                  ((uint32_t)0x60000000)        /*!< Data PID */
#define USB_OTG_HCTSIZ_DPID_0                ((uint32_t)0x20000000)        /*!<Bit 0 */
#define USB_OTG_HCTSIZ_DPID_1                ((uint32_t)0x40000000)        /*!<Bit 1 */

/********************  Bit definition forUSB_OTG_DIEPDMA register  *****************/
#define USB_OTG_DIEPDMA_DMAADDR              ((uint32_t)0xFFFFFFFF)        /*!< DMA address */

/********************  Bit definition forUSB_OTG_HCDMA register  *******************/
#define USB_OTG_HCDMA_DMAADDR                ((uint32_t)0xFFFFFFFF)        /*!< DMA address */

/********************  Bit definition forUSB_OTG_DTXFSTS register  *****************/
#define USB_OTG_DTXFSTS_INEPTFSAV            ((uint32_t)0x0000FFFF)        /*!< IN endpoint TxFIFO space avail */

/********************  Bit definition forUSB_OTG_DIEPTXF register  *****************/
#define USB_OTG_DIEPTXF_INEPTXSA             ((uint32_t)0x0000FFFF)        /*!< IN endpoint FIFOx transmit RAM start address */
#define USB_OTG_DIEPTXF_INEPTXFD             ((uint32_t)0xFFFF0000)        /*!< IN endpoint TxFIFO depth */

/********************  Bit definition forUSB_OTG_DOEPCTL register  *****************/
#define USB_OTG_DOEPCTL_MPSIZ                ((uint32_t)0x000007FF)        /*!< Maximum packet size */
#define USB_OTG_DOEPCTL_USBAEP               ((uint32_t)0x00008000)        /*!< USB active endpoint */
#define USB_OTG_DOEPCTL_NAKSTS               ((uint32_t)0x00020000)        /*!< NAK status */
#define USB_OTG_DOEPCTL_SD0PID_SEVNFRM       ((uint32_t)0x10000000)        /*!< Set DATA0 PID */
#define USB_OTG_DOEPCTL_SODDFRM              ((uint32_t)0x20000000)        /*!< Set odd frame */
#define USB_OTG_DOEPCTL_EPTYP                ((uint32_t)0x000C0000)        /*!< Endpoint type */
#define USB_OTG_DOEPCTL_EPTYP_0              ((uint32_t)0x00040000)        /*!<Bit 0 */
#define USB_OTG_DOEPCTL_EPTYP_1              ((uint32_t)0x00080000)        /*!<Bit 1 */
#define USB_OTG_DOEPCTL_SNPM                 ((uint32_t)0x00100000)        /*!< Snoop mode */
#define USB_OTG_DOEPCTL_STALL                ((uint32_t)0x00200000)        /*!< STALL handshake */
#define USB_OTG_DOEPCTL_CNAK                 ((uint32_t)0x04000000)        /*!< Clear NAK */
#define USB_OTG_DOEPCTL_SNAK                 ((uint32_t)0x08000000)        /*!< Set NAK */
#define USB_OTG_DOEPCTL_EPDIS                ((uint32_t)0x40000000)        /*!< Endpoint disable */
#define USB_OTG_DOEPCTL_EPENA                ((uint32_t)0x80000000)        /*!< Endpoint enable */

/********************  Bit definition forUSB_OTG_DOEPINT register  *****************/
#define USB_OTG_DOEPINT_XFRC                 ((uint32_t)0x00000001)        /*!< Transfer completed interrupt */
#define USB_OTG_DOEPINT_EPDISD               ((uint32_t)0x00000002)        /*!< Endpoint disabled interrupt */
#define USB_OTG_DOEPINT_STUP                 ((uint32_t)0x00000008)        /*!< SETUP phase done */
#define USB_OTG_DOEPINT_OTEPDIS              ((uint32_t)0x00000010)        /*!< OUT token received when endpoint disabled */
#define USB_OTG_DOEPINT_B2BSTUP              ((uint32_t)0x00000040)        /*!< Back-to-back SETUP packets received */
#define USB_OTG_DOEPINT_NYET                 ((uint32_t)0x00004000)        /*!< NYET interrupt */

/********************  Bit definition forUSB_OTG_DOEPTSIZ register  ****************/
#define USB_OTG_DOEPTSIZ_XFRSIZ              ((uint32_t)0x0007FFFF)        /*!< Transfer size */
#define USB_OTG_DOEPTSIZ_PKTCNT              ((uint32_t)0x1FF80000)        /*!< Packet count */

#define USB_OTG_DOEPTSIZ_STUPCNT             ((uint32_t)0x60000000)        /*!< SETUP packet count */
#define USB_OTG_DOEPTSIZ_STUPCNT_0           ((uint32_t)0x20000000)        /*!<Bit 0 */
#define USB_OTG_DOEPTSIZ_STUPCNT_1           ((uint32_t)0x40000000)        /*!<Bit 1 */

/********************  Bit definition for PCGCCTL register  ************************/
#define USB_OTG_PCGCCTL_STOPCLK              ((uint32_t)0x00000001)        /*!< SETUP packet count */
#define USB_OTG_PCGCCTL_GATECLK              ((uint32_t)0x00000002)        /*!<Bit 0 */
#define USB_OTG_PCGCCTL_PHYSUSP              ((uint32_t)0x00000010)        /*!<Bit 1 */
#endif

/**
  * @}
*/

/**
  * @}
*/ 

/** @addtogroup Exported_macro
  * @{
  */

